nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/MCXW236B.xml
        <register>
          <name>SECURE_BOOT_CFG</name>
          <description>.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSA4K</name>
              <description>Use RSA4096 keys only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSA2048</name>
                  <description>Allow RSA2048 and higher</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSA4096_0</name>
                  <description>RSA4096 only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSA4096_1</name>
                  <description>RSA4096 only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSA4096_2</name>
                  <description>RSA4096 only</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZM_IMAGE_TYPE</name>
              <description>TrustZone-M mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HEADER</name>
                  <description>TZ-M image mode is taken from application image header</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>TZ-M disabled image, boots to non-secure mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>TZ-M enabled image, boots to secure mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESET</name>
                  <description>TZ-M enabled image with TZ-M preset, boot to secure mode TZ-M pre-configured by data from application image header</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOCK_SET_KEY</name>
              <description>Block PUF key code generation</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOW</name>
                  <description>Allow PUF Key Code generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_0</name>
                  <description>Disable PUF Key Code generation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_1</name>
                  <description>Disable PUF Key Code generation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_2</name>
                  <description>Disable PUF Key Code generation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIP_BOOT_SEED</name>
              <description>Skip boot seed computation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable BOOT_SEED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_0</name>
                  <description>Disable BOOT_SEED</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_1</name>
                  <description>Disable BOOT_SEED</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_2</name>
                  <description>Disable BOOT_SEED</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_SEED_INC_NXP_CFG</name>
              <description>Include NXP area in BOOT SEED computation</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUDE</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_0</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_1</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_2</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_SEED_CUST_CFG</name>
              <description>Include Customer factory area (including keys) in BOOT SEED computation.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUDE</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_0</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_1</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_2</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_SEED_INC_SEC_EPOCH</name>
              <description>Include security EPOCH in BOOT_SEED computation.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INCLUDE</name>
                  <description>not included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_0</name>
                  <description>included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_1</name>
                  <description>included</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLUDE_2</name>
                  <description>included</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_BOOT_EN</name>
              <description>Secure boot enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Plain image (internal flash with or without CRC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Boot signed images. (internal flash, RSA signed)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Boot signed images. (internal flash, RSA signed)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2</name>
                  <description>Boot signed images. (internal flash, RSA signed)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRINCE_CFG</name>
          <description>Prince Configuration</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEE</name>
              <description>Global Encryption Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDE</name>
              <description>Global Decryption Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLK</name>
              <description>System Lock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLK</name>
              <description>Global Lock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
