nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/MCXW236B.xml
        <register>
          <dim>23</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA0_ITRIG_INMUX[%s]</name>
          <description>Trigger select register for DMA0 channel</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Trigger input number (decimal value) for DMA channel n (n = 0 to 22).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Pin interrupt 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Pin interrupt 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>Pin interrupt 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Pin interrupt 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>Timer CTIMER0 Match 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>Timer CTIMER0 Match 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Timer CTIMER1 Match 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Timer CTIMER1 Match 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>Timer CTIMER2 Match 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>Timer CTIMER2 Match 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>Timer CTIMER3 Match 0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>Timer CTIMER3 Match 1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>Timer CTIMER4 Match 0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>Timer CTIMER4 Match 1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>COMP_OUTPUT</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>DMA0 output trigger mux 0</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>DMA0 output trigger mux 1</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>DMA0 output trigger mux 1</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>DMA0 output trigger mux 3</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>SCT0 DMA request 0</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>SCT0 DMA request 1</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>HASH DMA RX trigger</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_22</name>
                  <description>None</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_23</name>
                  <description>None</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_24</name>
                  <description>None</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_25</name>
                  <description>None</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_26</name>
                  <description>None</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_27</name>
                  <description>None</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_28</name>
                  <description>None</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_29</name>
                  <description>None</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_30</name>
                  <description>None</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22_31</name>
                  <description>None</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA0_OTRIG_INMUX[%s]</name>
          <description>DMA0 output trigger selection to become DMA0 trigger</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>DMA trigger output number (decimal value) for DMA channel n (n = 0 to 22).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>HASH DMA TX trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>None</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>None</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>SPIFI trigger</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>Flexcomm 0 RX trigger</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>Flexcomm 0 TX trigger</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Flexcomm 1 RX trigger</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Flexcomm 1 TX trigger</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>Flexcomm 2 RX trigger</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>Flexcomm 2 TX trigger</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_10</name>
                  <description>None</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_11</name>
                  <description>None</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_12</name>
                  <description>None</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_13</name>
                  <description>None</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_14</name>
                  <description>None</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_15</name>
                  <description>None</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_16</name>
                  <description>None</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_17</name>
                  <description>None</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_18</name>
                  <description>None</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_19</name>
                  <description>None</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_20</name>
                  <description>None</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_21</name>
                  <description>None</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_22</name>
                  <description>None</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_23</name>
                  <description>None</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_24</name>
                  <description>None</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_25</name>
                  <description>None</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_26</name>
                  <description>None</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_27</name>
                  <description>None</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_28</name>
                  <description>None</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_29</name>
                  <description>None</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_30</name>
                  <description>None</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10_31</name>
                  <description>None</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQMEAS_REF</name>
          <description>Selection for frequency measurement reference clock</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CLKIN</name>
              <description>Clock source number (decimal value) for frequency measure function target clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL32M</name>
                  <description>32MHz crystal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO12M</name>
                  <description>12MHz FRO clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO32M</name>
                  <description>32MHz FRO clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO1M</name>
                  <description>1MHz FRO clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC32K</name>
                  <description>32kHz RTC clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>System AHB clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPIFI_CLK</name>
                  <description>SPIFI clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_3</name>
                  <description>PIO0_3 input pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_11</name>
                  <description>PIO0_11 input pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_12</name>
                  <description>PIO0_12 input pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_14</name>
                  <description>PIO0_14 input pin</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQMEAS_TARGET</name>
          <description>Selection for frequency measurement target clock</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CLKIN</name>
              <description>Clock source number (decimal value) for frequency measure function target clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL32M</name>
                  <description>32MHz crystal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO12M</name>
                  <description>12MHz FRO clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO32M</name>
                  <description>32MHz FRO clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO1M</name>
                  <description>1MHz FRO clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC32K</name>
                  <description>32kHz RTC clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>System AHB clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPIFI_CLK</name>
                  <description>SPIFI clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_3</name>
                  <description>PIO0_3 input pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_11</name>
                  <description>PIO0_11 input pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_12</name>
                  <description>PIO0_12 input pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_14</name>
                  <description>PIO0_14 input pin</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
